CREATE DATABASE IF NOT EXISTS studentdb;
USE studentdb;

CREATE TABLE IF NOT EXISTS students (
                                        id INT AUTO_INCREMENT PRIMARY KEY,
                                        last_name VARCHAR(50),
    first_name VARCHAR(50),
    middle_name VARCHAR(50),
    birth_date DATE,
    record_book_number VARCHAR(20)
    );

INSERT INTO students (last_name, first_name, middle_name, birth_date, record_book_number) VALUES
                                                                                              ('Іваненко', 'Олег', 'Сергійович', '2002-01-12', 'RB1001'),
                                                                                              ('Петренко', 'Марія', 'Олександрівна', '2001-02-25', 'RB1002'),
                                                                                              ('Сидоренко', 'Іван', 'Ігорович', '2000-03-05', 'RB1003'),
                                                                                              ('Коваль', 'Андрій', 'Олегович', '2002-04-16', 'RB1004'),
                                                                                              ('Шевченко', 'Оксана', 'Юріївна', '2001-05-30', 'RB1005'),
                                                                                              ('Бондар', 'Катерина', 'Андріївна', '2002-07-14', 'RB1006'),
                                                                                              ('Ткаченко', 'Юрій', 'Борисович', '2001-08-21', 'RB1007'),
                                                                                              ('Мельник', 'Валентина', 'Вікторівна', '2000-09-11', 'RB1008'),
                                                                                              ('Лисенко', 'Павло', 'Сергійович', '2001-10-01', 'RB1009'),
                                                                                              ('Романенко', 'Ірина', 'Володимирівна', '2002-11-18', 'RB1010'),
                                                                                              ('Захарченко', 'Олег', 'Олексійович', '2001-12-03', 'RB1011'),
                                                                                              ('Демченко', 'Ольга', 'Василівна', '2000-01-22', 'RB1012'),
                                                                                              ('Гончар', 'Ігор', 'Петрович', '2002-02-13', 'RB1013'),
                                                                                              ('Левченко', 'Анна', 'Миколаївна', '2000-03-27', 'RB1014'),
                                                                                              ('Паламарчук', 'Віктор', 'Анатолійович', '2001-04-09', 'RB1015'),
                                                                                              ('Кравець', 'Світлана', 'Ігорівна', '2002-05-06', 'RB1016'),
                                                                                              ('Козак', 'Михайло', 'Іванович', '2001-07-19', 'RB1017'),
                                                                                              ('Олійник', 'Дарина', 'Романівна', '2000-08-29', 'RB1018'),
                                                                                              ('Білик', 'Віталій', 'Сергійович', '2001-10-15', 'RB1019'),
                                                                                              ('Яремчук', 'Наталія', 'Олександрівна', '2002-11-23', 'RB1020');
